package com.motaharinia.crud.utility.custom.customvalidation;

/**
 * @author eng.motahari@gmail.com<br>
 * کلاس مقادیر ثابت عبارات منظم برای اعتبارسنجی
 * سایت خوب برای تست regex جاوا شامل کارکترهای یونیکد :
 * https://www.freeformatter.com/java-regex-tester.html
 */
public enum CustomValidationRegularExceptionEnum {

    /**
     * عبارت منظم اعتبارسنجی تلفن ثابت سازمان که میتواند بین 4 تا 8 رقم باشد
     */
    COMPANY_PHONE("[0-9]{4,8}"),
    /**
     * عبارت منظم اعتبارسنجی تاریخ
     */
    DATE("^[0-9]{4}-[0-9]{2}-[0-9]{2}$"),
    /**
     * عبارت منظم اعتبارسنجی نشانی پست الکترونیکی
     */
    EMAIL("(?:[a-z0-9!#$%&'*+/=?^_`{|}~-]+(?:\\.[a-z0-9!#$%&'*+/=?^_`{|}~-]+)*|\"(?:[\\x01-\\x08\\x0b\\x0c\\x0e-\\x1f\\x21\\x23-\\x5b\\x5d-\\x7f]|\\\\[\\x01-\\x09\\x0b\\x0c\\x0e-\\x7f])*\")@(?:(?:[a-z0-9](?:[a-z0-9-]*[a-z0-9])?\\.)+[a-z0-9](?:[a-z0-9-]*[a-z0-9])?|\\[(?:(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\\.){3}(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?|[a-z0-9-]*[a-z0-9]:(?:[\\x01-\\x08\\x0b\\x0c\\x0e-\\x1f\\x21-\\x5a\\x53-\\x7f]|\\\\[\\x01-\\x09\\x0b\\x0c\\x0e-\\x7f])+)])"),
    /**
     * عبارت منظم اعتبارسنجی رشته با الفبای لاتین و فاصله
     */
    LATIN_CHARACTERS("^[(a-z)|(A-Z)(\\u0020)]+$"),
    /**
     * عبارت منظم اعتبارسنجی تلفن همراه
     */
    MOBILE("^(09|\\+989)[0-9]{9}$"),
    /**
     * عبارت منظم اعتبارسنجی کد اقتصادی سازمان که باید عددی 14 رقمی باشد
     */
    ORGANIZATION_ECONOMIC_CODE("[0-9]{14}"),
    /**
     * عبارت منظم اعتبارسنجی کد ملی سازمان که باید عددی 11 رقمی باشد
     */
    ORGANIZATION_NATIONAL_CODE("[0-9]{11}"),
    /**
     * عبارت منظم اعتبارسنجی مقدار عددی
     */
    NUMERIC_VALUE("[0-9]+"),
    /**
     * عبارت منظم اعتبارسنجی رمز پیچیده
     *رمز عبور ترکیبی از حروف انگلیسی کوچک و بزرگ ، اعداد و کارکترهای خاص باشد
     *طول رمز عبور حداقل یک کارکتر باشد
     */
//    PASSWORD_COMPLEXITY("^(?=.*[0-9])(?=.*[a-z])(?=.*[A-Z])(?=.*[@#$%^&+=])(?=\\S+$).{8,}$"),
//    PASSWORD_COMPLEXITY("^(?=.*[0-9])(?=.*[a-z])(?=.*[A-Z])(?=.*[@#$%*&!+=^])(?=\\S+$).{1,}$"),
    PASSWORD_COMPLEXITY("^(?=.*[0-9])(?=.*[a-z])(?=.*[A-Z])(?=.*[%COMPLECATED_SPECIAL_CHARS%]).{1,}$"),
    /**
     * عبارت منظم اعتبارسنجی رشته با الفبای فارسی و فاصله
     */
    PERSIAN_CHARACTERS_SPACE("^[(\\u0600-\\u06FF)|(\\u0020)]+$"),
    /**
     * عبارت منظم اعتبارسنجی رشته با الفبای فارسی و فاصله و اعداد
     */
    PERSIAN_CHARACTERS_SPACE_NUMBERS("^[(\\u0600-\\u06FF)|(\\u0020)|(0-9)]+$"),
    /**
     * عبارت منظم اعتبارسنجی نشانی شامل رشته با الفبای فارسی و فاصله و اعداد و خط تیره
     */
    PERSIAN_ADDRESS("^[(\\u0600-\\u06FF)|(\\u0020)|(0-9)|(\\-)]+$"),
    /**
     * عبارت منظم اعتبارسنجی شماره تلفن منزل که میتواند 8 رقم باشد
     */
    PERSON_PHONE("[0-9]{8}"),
    /**
     * عبارت منظم اعتبارسنجی کد پستی
     */
    POSTAL_CODE("[0-9]{10}"),
    /**
     * عبارت منظم اعتبارسنجی رشته با الفبای لاتین و اعداد
     */
    LATIN_CHARACTERS_NUMBERS("^[a-zA-Z0-9]*$"),
    /**
     * نشانی وب. حالتهای صحیح و غلط:
     * regex101.com/r/HUNasA/2
     */
    URL("^(http:\\/\\/www\\.|https:\\/\\/www\\.|http:\\/\\/|https:\\/\\/)?[a-z0-9]+([\\-\\.]{1}[a-z0-9]+)*\\.[a-z]{2,5}(:[0-9]{1,5})?(\\/.*)?$"),
    ;
    private final String value;

    CustomValidationRegularExceptionEnum(String value) {
        this.value = value;
    }

    public String getValue() {
        return value;
    }

}
